# Install with `brew bundle install`
# Update with `brew bundle dump`

cask_args appdir: "~/Applications"

# Apps
cask "keycastr"
cask "mos"  # External mouse scroll
cask "iina"
cask "deskpad"
cask "zen"
cask "orion"
cask "1password"
cask "1password-cli"
cask "shottr"
cask "spotify"
cask "raycast"
cask "itouuuuuuuuu/tap/zmk-battery-bar"

# Window management
tap "nikitabobko/tap"
tap "FelixKratz/formulae"
cask "nikitabobko/tap/aerospace"
brew "sketchybar", restart_service: :changed

# Terminal
brew "cmake"
cask "rar"
brew "unar"
brew "wget"
brew "terminal-notifier"
brew "ical-buddy"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "cloc"
brew "cairo"
brew "zsh"
brew "bat"
brew "diff-so-fancy"
brew "eza"
brew "fd"
brew "zoxide"
brew "ripgrep"
brew "jq"
brew "fzf"
brew "imagemagick"
brew "tree"
brew "gh"

# Terminal apps
brew "vim"
brew "yazi"  # File browser
brew "lazygit"
brew "presenterm"

# Programming
cask "yaak"
cask "kitty"
tap "getsentry/tools"
brew "getsentry/tools/sentry-cli"
cask "db-browser-for-sqlite"
brew "watchman"
brew "zk"
brew "python-setuptools"
brew "fnm"
brew "lua"

# Work
cask "tunnelblick"
cask "mongodb-compass"
tap "azhuchkov/tools"
brew "azhuchkov/tools/tunblkctl"
tap "stripe/stripe-cli"
brew "stripe/stripe-cli/stripe"
brew "pulumi"
brew "mongocli"
brew "awscli"
cask "slack"
cask "figma"
cask "cursor"
brew "schpet/tap/linear"
brew "chrome-devtools-mcp"
# cask "cursor-cli"
# Deps
brew "pkg-config"
brew "cairo"
brew "pango"
brew "libpng"
brew "jpeg"
brew "giflib"
brew "librsvg"
brew "pixman"
brew "python-setuptools"

# Neovim and friends
brew "neovim", args: ["HEAD"]
brew "stylua"
brew "tree-sitter-cli"
brew "lua-language-server"

# Fonts
cask "font-anonymous-pro"
cask "font-cascadia-code"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ibm-plex-mono"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-maple-mono"
cask "font-monaspace"
cask "font-roboto-mono-nerd-font"
cask "font-source-code-pro"
cask "font-victor-mono"
cask "font-lilex"

# Tools
brew "ansible"
