# Install with `brew bundle install`
# Update with `brew bundle dump`

cask_args appdir: "~/Applications"

# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# Apps
cask "keycastr"
cask "mos"  # External mouse scroll
cask "iina"
cask "deskpad"

# Window management
tap "nikitabobko/tap"
tap "felixkratz/formulae"
cask "aerospace"
brew "sketchybar", restart_service: :changed

# Terminal
brew "cmake"
cask "rar"
brew "unar"
brew "wget"
brew "terminal-notifier"
brew "ical-buddy"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "cloc"
brew "cairo"
brew "zsh"
brew "bat"
brew "diff-so-fancy"
brew "eza"
brew "fd"
brew "zoxide"
brew "ripgrep"
brew "jq"
brew "fzf"
brew "imagemagick"
brew "tree"

# Terminal apps
brew "vim"
brew "yazi"  # File browser
brew "lazygit"
brew "presenterm"

# Programming
cask "insomnia"
cask "kitty"
tap "getsentry/tools"
brew "getsentry/tools/sentry-cli"
cask "db-browser-for-sqlite"
brew "watchman"
brew "zk"
brew "python-setuptools"
brew "fnm"
brew "lua"

# Work
cask "tunnelblick"
cask "mongodb-compass"
tap "azhuchkov/tools"
brew "azhuchkov/tools/tunblkctl"
tap "stripe/stripe-cli"
brew "stripe/stripe-cli/stripe"
brew "pulumi"
brew "mongocli"
brew "awscli"

# Neovim and friends
brew "neovim", args: ["HEAD"]
brew "stylua"
brew "tree-sitter-cli"
brew "lua-language-server"

# Fonts
cask "font-anonymous-pro"
cask "font-cascadia-code"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ibm-plex-mono"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-maple-mono"
cask "font-monaspace"
cask "font-roboto-mono-nerd-font"
cask "font-source-code-pro"
cask "font-victor-mono"
